app/controllers/order_controller.rb

SELECT "orders".* FROM "orders"
---
  def show
  	@order= Order.all