app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 9]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 1], ["order_id", 1], ["unit_price", 35.0], ["quantity", 1], ["total_price", 35.0], ["created_at", "2017-12-19 01:41:50.096391"], ["updated_at", "2017-12-19 01:41:50.096391"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES (?, ?, ?)  [["subtotal", 35.0], ["created_at", "2017-12-19 01:41:50.056863"], ["updated_at", "2017-12-19 01:41:50.056863"]]
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 18], ["id", 53], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 9], ["id", 13], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 13]]
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy