app/controllers/products_controller.rb

  def index
    @products = Product.where(:user_id => current_user.id)
    @categoria = Category.all
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]
SELECT "categories".* FROM "categories"

  def new
    @product = Product.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @product = current_user.products.new(product_params)
     @product.categories=params[:categories]
    if @product.save
---
INSERT INTO "has_categories" ("products_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["products_id", 17], ["category_id", 1], ["created_at", "2018-01-13 04:08:16.600972"], ["updated_at", "2018-01-13 04:08:16.600972"]]
INSERT INTO "products" ("title", "price", "created_at", "updated_at", "cantidad", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dragon ball"], ["price", 30.0], ["created_at", "2018-01-13 00:28:22.650588"], ["updated_at", "2018-01-13 00:28:22.650588"], ["cantidad", 5], ["user_id", 1]]

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "title" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "pes"], ["price", 40.0], ["updated_at", "2018-01-13 04:55:15.454823"], ["id", 15]]

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
    @category = Category.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]